---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
source: html/0d31b6b8-a587-2c2b-8feb-a73b7d989f04.htm
---
# StructuralSectionGeneralI Properties

Common set of parameters for structural analysis.